// =================================================================
// Задача 4: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.

// 5 -> 2, 4
// 8 -> 2, 4, 6, 8
// ==================================================================

int i = 2;
Console.WriteLine("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Четные числа от 1 до {num}: ");

if (num < 2)
{
    Console.WriteLine("Нет чётных чисел");
}
else
{
    while (i <= num-2)
    {
        Console.Write(i + ", ");
        i += 2;
    }
    Console.Write(i);
}
